# Завдання: написати програму обчислення факторіалу числа.
#           Программа запитує ввод від користувача у циклі
#           (вихід можливий за допомогою Ctrl-C/D)
# 
# Факторіал числа: n!
# n! = 1 * 2 * 3 * 4 ... n-1 * n
# 0! = 1
#
# Приклад роботи:
#
# Введіть число для обчислення факторіалу: 5
# 5! == 120
# 
# Введіть число для обчислення факторіалу: -5
# Невірний ввод


n = 5
fact =1

while True:
    try:
        n = int(input("Введіть число для обчислення факторіалу: "))
        if n >= 0:
            for i in range(1, n+1):
                fact = fact * i
            print(f'{n}! == {fact}')
            break
        else:
            print('Невірний ввод')
    except KeyboardInterrupt:
        break